var foodmatrix = [
	[350, "Цезарь с курицей"],
	[390, "Цезарь с тигровыми креветками"],
	[340, "Салат по итальянски"],
	[330, "Салат Ницца"],
	[330, "Салат Греческий"],
	[315, "Салат Рукола и клубника"],
	[225, "Крем суп с шампиньонами"],

	[255, "Ролл цезарь"],
	[265, "Ролл Филадельфия"],
	[255, "Ролл с ветчиной и омлетом"],
	[290, "Клаб сендвич"],
	[320, "Бургер"],
	[245, "Кесадилья овощная"],
	[290, "Кесадилья с курицей"],
	[275, "Фоккачино с курицей барбекю"],
	[265, "Тост с сыром и ветчиной"],

	[320, "Мясная лазанья"],
	[290, "Куриная грудка с пюре"],
	[290, "Куриная грудка с овощами"],
	[450, "Сибас на пару с пюре"],
	[450, "Сибас на пару с овощами гриль"],
	[450, "Сибас на пару с кускусом и соусом песто"],
	[450, "Сибас на пару с картофелем по домашнему"],
	[290, "Биточки с томленой уткой"],

	[360, "Лапша с тигровыми креветками"],
	[320, "Паста карбанара"],
	[325, "Паста Альфредо с курицей"],
	[360, "Ригатони с копченным лососем"],
	[320, "Мясная лазанья"],
	[290, "Куриная грудка с пюре"],
	[290, "Куриная грудка с овощами"],
	[450, "Сибас на пару с пюре"],
	[450, "Сибас на пару с овощами гриль"],
	[450, "Сибас на пару с кускусом и соусом песто"],
	[450, "Сибас на пару с картофелем по домашнему"],
	[340, "Биточки с томленой уткой"],

	[275, "Торт Москва"],
	[250, "Торт Медовик"],
	[250, "Торт Прага"],
	[240, "Торт Опера"],
	[270, "Торт Наполеон с клубникой"],
	[250, "Чизкейк орео"],
	[130, "Эклер ванильный"],
	[130, "Эклер шоколадный"],
	[220, "Тарталетка с ягодами"],
	[195, "Торт лимонный с меренгой"],
	[240, "Чизкейк яблочный"],
	[240, "Чизкейк Нью-йорк"],
	[260, "Фисташковый торт с профитроли"],

	[265, "Блинчики малиновые"],
	[265, "Легендарные с шоколадом"],
	[265, "Блинчики с сыром и ветчиной"],
	[265, "Блинчики с маком"],
	[265, "Блинчики с мясом"],
	[265, "Сырники со сметаной и малиновым соусом"],
	[275, "Блины с жюльеном"],
	[275, "Блины с творогом"],
	[265, "Блины яблочно-карамельные"],

	[130, "Аква минерале с газом"],
	[130, "Аква без газа"],
	[140, "Пепси"],
	[140, "Пепси лайт"],
	[140, "Миринда оранж"],
	[140, "Севенап"],
	[150, "Сок я яблочный"],
	[150, "Сок я апельсиновый"]

];





var foodlenght = 0 ;
foodlenght = foodmatrix.length;

var foodprice = 0;
var bag = "";

var i;
var j;
var k;
var list = document.getElementById('my-list');

for (i = 0; i < foodlenght; i++) {
	var header = foodmatrix[i][1]+ " + ";
	var textnode2 = document.createTextNode(header);
	var item2 = document.createElement('h3');
	item2.appendChild(textnode2);
	list.append(item2);


	for (j = 0; j < foodlenght; j++) {
		for (k = 0; k < foodlenght; k++) {
			foodprice = foodmatrix[i][0] + foodmatrix[j][0] + foodmatrix[k][0];
			bag = Array(foodmatrix[j][1], foodmatrix[k][1]).join(' + ');
			if ((foodprice > 749)&&(foodprice < 756)) {
				if( i != j && j != k && k != i) {
					var textnode = document.createTextNode(bag + " — " + foodprice);
					var item = document.createElement('li');
					item.appendChild(textnode);
					list.append(item);
				}
			}
		}
	}

}